def task_1():
    P1 = int(input('Введите изначальную цену: '))
    P2 = int(input('Введите измененную цену: '))
    Q1 = int(input('Введите изначальное количество: '))
    Q2 = int(input('Введите измененное количество: '))

    if P1/P2 < 1:
        price = int((1-(P1/P2))*100)
        print(f'Цена выросла на: {int((1-(P1/P2))*100)} %')
    elif P2/P1<1:
        price = int(((P2/P1) - 1)*100)
        print(f'Цена снизилась на: {int(((P2/P1) - 1)*100)} %')


    if Q1/Q2 < 1:
        quantity = int((1 - (Q1/Q2))*100)
        print(f'Количество выросла на: {int((1 - (Q1/Q2))*100)} %')
    elif Q2/Q1 < 1:
        quantity = int(((Q2 / Q1) - 1) * 100)
        print(f'Количество снизилась на: {int(((Q2/Q1) - 1)*100)} %')


    Ed = abs(quantity/price)

    if Ed>1:
        print(f'Эластичность спроса по цене равна: {Ed:.2f}, спрос эластичен')
    elif Ed<1:
        print(f'Эластичность спроса по цене равна: {Ed:.2f}, спрос эластичен')

task_1()